In [25]:
import pandas as pd
import numpy as np
from numpy.random import randn
df = pd.DataFrame(randn(5, 4), index="A B C D E".split(), columns="W X Y Z".split())
df

          W         X         Y         Z
A -0.374473  0.352272  1.155060 -0.441081
B  1.135192 -1.230695  0.884749 -1.043137
C  1.278402 -0.787196 -0.722503 -0.225133
D  0.373164 -1.189973 -1.406134  0.513643
E  1.663134 -1.400552  0.968859 -0.005427

In [26]:
df.loc[["A","B"], "Z"]

A   -0.441081
B   -1.043137
Name: Z, dtype: float64

In [27]:
df.loc[["A","B"], ["Z"]]

          Z
A -0.441081
B -1.043137

In [28]:
df.iloc[:-3, 3:]

          Z
A -0.441081
B -1.043137

In [29]:
df.iloc[1:4, 1:3]

          X         Y
B -1.230695  0.884749
C -0.787196 -0.722503
D -1.189973 -1.406134

In [30]:
df

          W         X         Y         Z
A -0.374473  0.352272  1.155060 -0.441081
B  1.135192 -1.230695  0.884749 -1.043137
C  1.278402 -0.787196 -0.722503 -0.225133
D  0.373164 -1.189973 -1.406134  0.513643
E  1.663134 -1.400552  0.968859 -0.005427

In [31]:
df + df

          W         X         Y         Z
A -0.748945  0.704544  2.310119 -0.882163
B  2.270384 -2.461390  1.769498 -2.086274
C  2.556804 -1.574392 -1.445006 -0.450265
D  0.746329 -2.379947 -2.812268  1.027287
E  3.326269 -2.801103  1.937718 -0.010853

In [32]:
df > 0

       W      X      Y      Z
A  False   True   True  False
B   True  False   True  False
C   True  False  False  False
D   True  False  False   True
E   True  False   True  False

In [33]:
df[df > 0]

          W         X         Y         Z
A       NaN  0.352272  1.155060       NaN
B  1.135192       NaN  0.884749       NaN
C  1.278402       NaN       NaN       NaN
D  0.373164       NaN       NaN  0.513643
E  1.663134       NaN  0.968859       NaN

In [34]:
df[df["Y"] > 0]

          W         X         Y         Z
A -0.374473  0.352272  1.155060 -0.441081
B  1.135192 -1.230695  0.884749 -1.043137
E  1.663134 -1.400552  0.968859 -0.005427

In [35]:
df[( df["Y"] > 0) & (df["W"] > 0 )]

          W         X         Y         Z
B  1.135192 -1.230695  0.884749 -1.043137
E  1.663134 -1.400552  0.968859 -0.005427

In [36]:
( df["Y"] > 0) & (df["W"] > 0 )

A    False
B     True
C    False
D    False
E     True
dtype: bool